Repository: maybemountains/WebPy-Final-Project
Catalog: Homework Assignment 8/translations/*/LC_MESSAGES/messages.po
Languages: sq_al

source: Destination Longitude
sq_al: Longjituda e Destinacionit

source: Destination Latitude
sq_al: Gjerësia e Destinacionit

source: Pickup Longitude
sq_al: Longjituda e Mberritjes

source: Pickup Latitude
sq_al: Gjerësia e Mberritjes

source: Time
sq_al: Koha

source: Car Type
sq_al: Lloji i Makinës

source: Card Holder Name
sq_al: Emri i Mbajtësit të Kartës

source: Card Number
sq_al: Numri i Kartës

source: Card Expiration Date
sq_al: Data e Skadencës së Kartës

source: Request
sq_al: Kërkesë

source: Message
sq_al: Mesazhi

source: Send
sq_al: Dërgo

source: rider
sq_al: udhëtar

source: driver
sq_al: shofer

source: Username
sq_al: Emri i Përdoruesit

source: Password
sq_al: Fjalëkalimi

source: Login
sq_al: Hyrje

source: Sign Up
sq_al: Regjistrohu

source: License Plate
sq_al: Targa e Makinës

source: Car Color
sq_al: Ngjyra e Makinës

source: Username already taken. Please choose another.
sq_al: Emri i përdoruesit është marrë. Ju lutemi zgjidhni një tjetër.

source: Invalid username or password
sq_al: Emri i përdoruesit ose fjalëkalimi i pavlefshëm

source: Already have an account? Login
sq_al: Tashmë keni një llogari? Hyr

source: Don't have an account? Sign up as a
sq_al: Nuk keni një llogari? Regjistrohuni si një

source: or
sq_al: ose

source: you edited your car information
sq_al: keni redaktuar informacionin e makinës suaj

source: Save
sq_al: Ruaj

source: Edit Car Info
sq_al: Redakto Informacionin e Makinës

source: Profile
sq_al: Profili

source: Home
sq_al: Ballina

source: Logout
sq_al: Çmeldimi

source: Edit Driver Info
sq_al: Redakto Informacionin e Shoferit

source: Delete Driver Info
sq_al: Fshi Informacionin e Shoferit

source: Page Not Found
sq_al: Faqja Nuk Gjendet

source: I'm sorry, but the page you seem to be looking for simply doesn't exist.
sq_al: Më vjen keq, por faqja që ju duket se kërkoni thjesht nuk ekziston.

source: To get back to home, click
sq_al: Për të kthyer në shtëpi, klikoni

source: here
sq_al: këtu

source: Internal Server Error
sq_al: Gabim i Brendshëm i Serverit

source: Apologies for the inconvenience, it seems like an error happened on our end, please try again!
sq_al: Na vjen keq për disavantazhin, duket se ka ndodhur një gabim nga ana jonë, ju lutemi provoni përsëri!

source: Refresh
sq_al: Rifresko

source: Pickup
sq_al: Marrje

source: Destination
sq_al: Destinacion

source: Price
sq_al: Çmimi

source: Select this ride
sq_al: Zgjidh këtë udhëtim

source: Request a Ride
sq_al: Kërko një udhëtim

source: Chat
sq_al: Bisedë

source: Arrived
sq_al: Ka mbërritur

source: Waiting for a driver to accept your ride request
sq_al: Duke pritur që një shofer të pranojë kërkesën tuaj për udhëtim

source: Cancel
sq_al: Anulo
